app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `email` = '1112389051'
OR `cedula` = '1112389051'
 LIMIT 1
---
    public function access()
    {
        $session = session();
        $userModel = new UserModel();

        $credential = $this->request->getPost('credential');
        $password = $this->request->getPost('password');

        // Buscar por cédula o correo electrónico
        $user = $userModel->where('email', $credential)
                          ->orWhere('cedula', $credential)
                          ->first();