app/Controllers/MenuController.php

SELECT *
FROM `users`
WHERE `cedula` = '1112389051'
 LIMIT 1
---
        public function userMenu() {
            $session = session();
            $cedula = $session->get('cedula');

            if (!$cedula) {
                return redirect()->to('/')->with('error', 'Debe iniciar sesión.');
            }

            $user = $this->userModel->where('cedula', $cedula)->first();