app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `cedula` = '1112389051'
 LIMIT 1
SELECT *
FROM `personal_info`
WHERE `cedula` = '1112389051'
AND `personal_info`.`deleted_at` IS NULL
 LIMIT 1
---
    public function index() {
        // Obtener el ID del usuario desde la sesión
        $cedula = session()->get('cedula');

        // Verificar si el usuario está autenticado
        if (!$cedula) {
            return redirect()->to('/')->with('error', 'Debe iniciar sesión.');
        }

        // Instancia del modelo de usuarios
        $userModel = new UserModel();
        $user = $userModel->where('cedula', $cedula)->first();

        // Verificar si el usuario existe
        if (!$user) {
            return redirect()->to('error')->with('message', 'Usuario no encontrado.');
        }

        // Obtener la foto de perfil (si existe)
        $profilePhoto = $user['profile_photo'] ?? 'ruta/default.jpg';

        // Instancia del modelo de información personal
        $personalInfoModel = new PersonalInfoModel();
        $personalInfo = $personalInfoModel->where('cedula', $cedula)->first();

SELECT *
FROM `users`
WHERE `users`.`cedula` = '1112389051'
---
    $profilePhoto = $this->request->getFile('profile_photo');
    if ($profilePhoto && $profilePhoto->isValid() && !$profilePhoto->hasMoved()) {
        // Obtener los datos actuales del usuario
        $currentUser = $userModel->find($cedula);

UPDATE `users` SET `name` = 'Jhon Alejandro', `last_name` = 'Martinez Potes', `document_type` = 'Cédula de Ciudadanía', `cedula` = '1112389051', `email` = 'jhonmartinez07@hotmail.com', `phone` = '3182988390', `profile_photo` = 'uploads/profile_photos/1112389051.jpg', `updated_at` = '2024-12-18 19:53:47'
WHERE `users`.`cedula` IN ('1112389051')
---
    }

    // Actualizar los datos del usuario en la base de datos
    $userModel->update($cedula, $data);