app/Controllers/UserInfoController.php

SELECT *
FROM `users`
WHERE `users`.`cedula` = '1112389051'
SELECT *
FROM `users`
WHERE `cedula` = '1112389051'
 LIMIT 1
---
public function index() {
    // Obtener la cédula desde la sesión
    $cedula = session()->get('cedula');

    if (!$cedula) {
        return redirect()->to('/')->with('error', 'Debe iniciar sesión.');
    }

    $userModel = new UserModel();

    // Obtiene los datos del usuario por ID
    $data['user'] = $userModel->find($cedula);

    if (!$data['user']) {
        return redirect()->to('/')->with('error', 'Usuario no encontrado.');
    }

    // Obtener la cédula directamente desde el usuario obtenido por ID
    $cedula = $data['user']['cedula'];
    $user = $userModel->where('cedula', $cedula)->first();

SELECT *
FROM `personal_info`
WHERE `cedula` = '1112389051'
AND `personal_info`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `academic_info`
WHERE `cedula` = '1112389051'
SELECT *
FROM `teaching_work_experience`
WHERE `cedula` = '1112389051'
SELECT *
FROM `additional_studies`
WHERE `cedula` = '1112389051'
SELECT *
FROM `work_experience`
WHERE `cedula` = '1112389051'
AND `work_experience`.`deleted_at` IS NULL
---
    $teachingExperienceModel = new TeachingWorkExperienceModel();

    // Obtener la información relacionada asegurando que devuelve arrays
    $personalInfo = $personalInfoModel->asArray()->where('cedula', $cedula)->first() ?? [];
    $academicInfo = $academicInfoModel->asArray()->where('cedula', $cedula)->findAll();
    $workExperience = $workExperienceModel->asArray()->where('cedula', $cedula)->findAll();
    $additionalStudies = $additionalStudyModel->asArray()->where('cedula', $cedula)->findAll();
    $teachingExperience = $teachingExperienceModel->asArray()->where('cedula', $cedula)->findAll();